In [3]:
import pandas as pd

print(pd.__version__)

1.0.5

In [4]:
data = {
    'names': ['길동', '둘리', '철수'],
    'age': [20, 30, 40],
    'addr': ['서울', '경기', '부산'],
}
# DataFrame 객체 생성
data_df = pd.DataFrame(data)

In [5]:
data_df.head() # 앞에서 몇개 가져오는 함수

  names  age addr
0    길동   20   서울
1    둘리   30   경기
2    철수   40   부산

In [6]:
# 집계함수 사용
data_df['gender'] = ['남', '여', '남']
data_df

  names  age addr gender
0    길동   20   서울      남
1    둘리   30   경기      여
2    철수   40   부산      남

In [7]:
# 나이 최대값, 최소, 평균, 중간
print('최대', data_df['age'].max())
print('최소', data_df['age'].min())
print('평균', data_df['age'].mean())
print('중간', data_df['age'].median())
print('카운트', data_df['age'].count())
print('합계', data_df['age'].sum())

최대 40
최소 20
평균 30.0
중간 30.0
카운트 3
합계 90

In [8]:
data_df.describe()

        age
count   3.0
mean   30.0
std    10.0
min    20.0
25%    25.0
50%    30.0
75%    35.0
max    40.0

In [9]:
data_df.tail(2) # 뒤에서 몇개 가져오는 함수

  names  age addr gender
1    둘리   30   경기      여
2    철수   40   부산      남

In [10]:
print('행과 열의 개수', data_df.shape) # 행과 열의 개수
print('컬럼명', data_df.columns) # 컬럼명
print('인덱스', data_df.index)
print('values', data_df.values, type(data_df.values))

행과 열의 개수 (3, 4)
컬럼명 Index(['names', 'age', 'addr', 'gender'], dtype='object')
인덱스 RangeIndex(start=0, stop=3, step=1)
values [['길동' 20 '서울' '남']
 ['둘리' 30 '경기' '여']
 ['철수' 40 '부산' '남']] <class 'numpy.ndarray'>

In [11]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   age     3 non-null      int64
 2   addr    3 non-null      object
 3   gender  3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [12]:
data_df.head()

  names  age addr gender
0    길동   20   서울      남
1    둘리   30   경기      여
2    철수   40   부산      남

In [13]:
# names 컬럼의 값들을 선택해라 select names from table명
# 한개의 열(컬럼)을 선택
print(type(data_df['names']))
data_df['names']

<class 'pandas.core.series.Series'>

0    길동
1    둘리
2    철수
Name: names, dtype: object

In [14]:
# 한개의 행(로우)을 선택
print(type(data_df.loc[0]))
data_df.loc[0]

<class 'pandas.core.series.Series'>

names     길동
age       20
addr      서울
gender     남
Name: 0, dtype: object

In [15]:
# Series 객체 생성
series1 = pd.Series([10, 20, 30])
series1

0    10
1    20
2    30
dtype: int64

In [16]:
series2 = pd.Series( {'title':'Dynamite', '가수':'방탄'} )
series2

title    Dynamite
가수             방탄
dtype: object

In [17]:
song_list = [
    {'title':'Dynamite', '가수':'방탄'},
    {'title':'오래된 노래', '가수':'스탠딩에그'},
    {'title':'Dont touch me', '가수':'환불원정대'},
]

# 빈 DataFrame 객체 생성
data_df = pd.DataFrame(columns=['title', '가수'])
data_df

Empty DataFrame
Columns: [title, 가수]
Index: []

In [18]:
for song in song_list:
    # series 객체 생성
    series_obj = pd.Series(song)
    # series 객체를 DataFrame 객체에 추가
    data_df = data_df.append(series_obj, ignore_index=True)
    
data_df

           title     가수
0       Dynamite     방탄
1         오래된 노래  스탠딩에그
2  Dont touch me  환불원정대

In [19]:
data_df

           title     가수
0       Dynamite     방탄
1         오래된 노래  스탠딩에그
2  Dont touch me  환불원정대